In [4]:
import pandas as pd
import numpy as np

In [5]:
data=pd.read_csv('Dataset/weather_data_1.csv')
data

        day  temperature  windspeed     event
0  1/1/2017           32          6      Rain
1  1/2/2017       -99999          7     Sunny
2  1/3/2017           28     -99999      Snow
3  1/4/2017       -99999          7  no event
4  1/5/2017           32     -99999      Rain
5  1/6/2017           31          2     Sunny
6  1/6/2017           34     -88888  no event

In [6]:
data.replace(to_replace=[-99999,-88888],value=np.nan)

        day  temperature  windspeed     event
0  1/1/2017         32.0        6.0      Rain
1  1/2/2017          NaN        7.0     Sunny
2  1/3/2017         28.0        NaN      Snow
3  1/4/2017          NaN        7.0  no event
4  1/5/2017         32.0        NaN      Rain
5  1/6/2017         31.0        2.0     Sunny
6  1/6/2017         34.0        NaN  no event

In [8]:
data.replace({
    'temperature':-99999,
    'windspeed':[-99999,-88888],
    'event':'Not Availble'
},np.nan)

        day  temperature  windspeed     event
0  1/1/2017         32.0        6.0      Rain
1  1/2/2017          NaN        7.0     Sunny
2  1/3/2017         28.0        NaN      Snow
3  1/4/2017          NaN        7.0  no event
4  1/5/2017         32.0        NaN      Rain
5  1/6/2017         31.0        2.0     Sunny
6  1/6/2017         34.0        NaN  no event

In [9]:
data.replace({
    -99999:np.nan,
    -88888:np.nan,
    'no event':'Sunny'
})

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0  Sunny
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        NaN  Sunny

In [11]:
new_data=pd.DataFrame({
    'score':['exceptional','average','good','poor','average','exceptinal'],
    'students':['Pooja','sumna','kiran','geeta','meena','punita']
})
new_data

         score students
0  exceptional    Pooja
1      average    sumna
2         good    kiran
3         poor    geeta
4      average    meena
5   exceptinal   punita